{
  "Version": "1.3",
  "ID": "f155vmnyxux6o6o7vk243o6oprjxnmf4lkln4yxoi",
  "Issue Number": "20",
  "Client": {
    "Name": "National Microbiology Data Center",
    "Region": "China",
    "Industry": "Life Science / Healthcare",
    "Website": "https://nmdc.cn/",
    "Social Media": "https://nmdc.cn/",
    "Social Media Type": "Other",
    "Role": "Data Preparer"
  },
  "Project": {
    "Brief history of your project and organization": "The National Microbiology Data Center (NMDC) was officially announced in June 2019 by the Ministry of Science and Technology and the Ministry of Finance. It is hosted by the Institute of Microbiology, Chinese Academy of Sciences, in collaboration with multiple entities including the Institute of Oceanology, Chinese Academy of Sciences, the Institute of Infectious Disease Prevention and Control, Chinese Center for Disease Control and Prevention, the Institute of Plant Physiology and Ecology, Chinese Academy of Sciences, and the Computer Network Information Center, Chinese Academy of Sciences. The superior administrative departments are the National Science and Technology Infrastructure Center of the Ministry of Science and Technology and the General Office of the Chinese Academy of Sciences.\r\n\r\nThe data resources at the center exceed 2PB in total volume, with more than 4 billion records. The content comprehensively covers all aspects of microbiology research lifecycle, including microbial resources, microbiological and interdisciplinary methodologies, research processes and engineering, microbiome studies, microbial technologies, as well as literature, patents, experts, achievements, and other information related to microbiology.\r\n\r\nThe NMDC focuses on promoting the aggregation and integration of scientific and technological resources in the field of microbiology onto the national platform, enhancing the development, application, analysis, and mining of microbial resources, improving the effective utilization of microbial resources, and supporting capabilities for scientific and technological innovation. The center aims to provide high-quality scientific and technological resource sharing services for scientific research, technological advancement, and social development.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "Various types of data resources, including but not limited to microbiome data, viral data resources, microbial resource data, etc.",
    "Where was the data currently stored in this dataset sourced from": "Other",
    "How do you plan to prepare the dataset": "No response",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "https://nmdc.cn/datadownload\r\nhttps://nmdc.cn/resource/search",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[X] I confirm",
    "What is the expected retrieval frequency for this data": "Sporadic",
    "For how long do you plan to keep this dataset stored on Filecoin": "2 to 3 years",
    "In which geographies do you plan on making storage deals": "Greater China, Asia other than Greater China, North America, Europe, Australia (continent)",
    "How will you be distributing your data to storage providers": "HTTP or FTP server, Shipping hard drives",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f03300963\r\nf01106668   \r\nf01315096   \r\nf0870558     \r\nf03055005  \r\nf03055018  \r\nf03055029   \r\nf01518369   \r\nf01889668",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "20PiB",
    "Single Size Dataset": "2PiB",
    "Replicas": 10,
    "Weekly Allocation": "1000TiB"
  },
  "Lifecycle": {
    "State": "Granted",
    "Validated At": "2025-05-08 17:03:04.764743157 UTC",
    "Validated By": "Bitengine-reeta",
    "Active": true,
    "Updated At": "2025-05-08 17:03:04.764739194 UTC",
    "Active Request ID": "dd2f701c-8193-444e-aab6-7c8d1c0b0f88",
    "On Chain Address": "f155vmnyxux6o6o7vk243o6oprjxnmf4lkln4yxoi",
    "Multisig Address": "false",
    "edited": false
  },
  "Allocation Requests": [
    {
      "ID": "cb0e434d-e17a-4e74-92e1-d6d566c293e8",
      "Request Type": "First",
      "Created At": "2025-02-27 08:20:46.242321296 UTC",
      "Updated At": "2025-02-27 08:20:46.242322491 UTC",
      "Active": false,
      "Allocation Amount": "500 TiB",
      "Signers": [
        {
          "Github Username": "Bitengine-reeta",
          "Signing Address": "f1km6utrorrtqh572e3ybfu7jq2gfktkgfghscr6i",
          "Created At": "2025-02-27 08:22:00.158000000 UTC",
          "Message CID": "bafy2bzacecdt3v352ugxa5otggszcwuxkctpnrc2d2virksk4zjppvqe72ryy"
        }
      ]
    },
    {
      "ID": "dd2f701c-8193-444e-aab6-7c8d1c0b0f88",
      "Request Type": "Refill",
      "Created At": "2025-05-08 17:01:36.057755474 UTC",
      "Updated At": "2025-05-08 17:01:36.057756233 UTC",
      "Active": false,
      "Allocation Amount": "1099511627776000B",
      "Signers": [
        {
          "Github Username": "Bitengine-reeta",
          "Signing Address": "f1km6utrorrtqh572e3ybfu7jq2gfktkgfghscr6i",
          "Created At": "2025-05-08 17:03:01.995000000 UTC",
          "Message CID": "bafy2bzaceclfz3dkgcfpnvwb7jyajrt2wy2cv4zvuh23kxqbojlk3jwmj4c7g"
        }
      ]
    }
  ]
}