{
  "Version": "1.3",
  "ID": "f1hzlscedx7iiloyb5aossps5ljmytl4hpiao5x3i",
  "Issue Number": "33",
  "Client": {
    "Name": "Google Research",
    "Region": "United States",
    "Industry": "Information, Media & Telecommunications",
    "Website": "YouTube-8M",
    "Social Media": "YouTube-8M",
    "Social Media Type": "Other",
    "Role": "Data Preparer"
  },
  "Project": {
    "Brief history of your project and organization": "YouTube-8M is a large-scale video understanding dataset project initiated by Google Research, aimed at providing high-quality annotated video data to the machine learning community to advance research in video content analysis, multimodal learning, and related fields. Launched in 2016, the project extracted visual and audio features from millions of publicly available YouTube videos, creating one of the largest open video datasets at the time.\n\nAs the supporting organization, Google Research has long been committed to developing open datasets and tools to promote equitable access to and innovation in AI technologies. The release of YouTube-8M filled a gap in the availability of large-scale annotated video data, establishing it as a key benchmark resource for computer vision and video classification tasks.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "The YouTube-8M dataset contains the following core components, making it well-suited for storage on the Filecoin decentralized storage network:\n\nVideo IDs and Metadata: Unique identifiers, titles, durations, and public tags (covering thousands of object, scene, and action categories) for 8 million YouTube videos.\n\nPrecomputed Features:\n\nVisual Features: Inception-v3 network features extracted from video frames (approximately 1,000 frames per video, totaling billions of frames).\n\nAudio Features: Acoustic features including Mel-Frequency Cepstral Coefficients (MFCC).\n\nAnnotation Data: Video-level labels (multi-label classification) generated by YouTube's automated annotation system, with partial human verification.",
    "Where was the data currently stored in this dataset sourced from": "Google Cloud",
    "How do you plan to prepare the dataset": "As a Filecoin data preparer, I would: 1) First clean and organize the raw data using Python and Spark tools to extract video features and metadata; 2) Package the processed data into CAR format files using IPFS tools and generate content identifiers (CIDs); 3) Finally store the data chunks on the Filecoin network via the Lotus client while recording storage deals and retrieval information. The entire process ensures data integrity and verifiability.",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "YouTube-8M Dataset Guide",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[x] I confirm",
    "What is the expected retrieval frequency for this data": "Sporadic",
    "For how long do you plan to keep this dataset stored on Filecoin": "2 to 3 years",
    "In which geographies do you plan on making storage deals": "Greater China, Asia other than Greater China, North America, South America, Europe, Australia (continent), Antarctica",
    "How will you be distributing your data to storage providers": "HTTP or FTP server, Shipping hard drives",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f03512458  \nf03512720  \nf03513151  \nf03513182  \nf01081394  \nf03528662  \nf03528925  \nf03528938  \nf03528948  \nf03528979  \nf01083919 \nf03529412  \nf03524179  ",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "10PiB",
    "Single Size Dataset": "1PiB",
    "Replicas": 10,
    "Weekly Allocation": "1000TiB"
  },
  "Lifecycle": {
    "State": "ReadyToSign",
    "Validated At": "2025-05-08 17:04:10.618602220 UTC",
    "Validated By": "Bitengine-reeta",
    "Active": true,
    "Updated At": "2025-05-08 17:04:10.618607066 UTC",
    "Active Request ID": "72f14b36-95ae-4147-a509-24437a0759a2",
    "On Chain Address": "f1hzlscedx7iiloyb5aossps5ljmytl4hpiao5x3i",
    "Multisig Address": "false",
    "edited": false
  },
  "Allocation Requests": [
    {
      "ID": "72f14b36-95ae-4147-a509-24437a0759a2",
      "Request Type": "First",
      "Created At": "2025-05-08 17:04:10.618609536 UTC",
      "Updated At": "2025-05-08 17:04:10.618611029 UTC",
      "Active": true,
      "Allocation Amount": "549755813888000 B",
      "Signers": []
    }
  ]
}